medtrack/app/controllers/medications_controller.rb

INSERT INTO "medications" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-03-09 20:59:35.231818"], ["updated_at", "2020-03-09 20:59:35.231818"]]
INSERT INTO "medications" ("brand_name", "dosage", "prescribing_doctor", "doctor_phone", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["brand_name", "test"], ["dosage", ""], ["prescribing_doctor", ""], ["doctor_phone", ""], ["user_id", 3], ["created_at", "2020-03-10 13:38:03.367569"], ["updated_at", "2020-03-10 13:38:03.367569"]]
---
  def create
    @user.medications.create!(medication_params)

    if @medication.save

UPDATE "medications" SET "brand_name" = $1, "dosage" = $2, "time" = $3, "prescribing_doctor" = $4, "doctor_phone" = $5, "notes" = $6, "updated_at" = $7 WHERE "medications"."id" = $8  [["brand_name", ""], ["dosage", ""], ["time", ""], ["prescribing_doctor", ""], ["doctor_phone", ""], ["notes", ""], ["updated_at", "2020-03-12 13:22:40.710697"], ["id", 61]]
---
  def update
    if @medication.update(medication_params)

DELETE FROM "medications" WHERE "medications"."id" = $1  [["id", 3]]
---
  def destroy
    @medication.destroy

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:user_id])

SELECT "medications".* FROM "medications" WHERE "medications"."user_id" = $1 AND "medications"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def set_medication
      @medication = @user.medications.find_by!(id: params[:id]) if @user