medtrack/app/controllers/pharmacies_controller.rb

    def set_user
      @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]