medtrack/app/controllers/pharmacies_controller.rb

SELECT "pharmacies".* FROM "pharmacies"
---
  def index
    @pharmacies = Pharmacy.all