medtrack/app/controllers/pharmacies_controller.rb

  def create
    @user.pharmacies.create!(pharmacy_params)

    # @pharmacy = Pharmacy.new(pharmacy_params)

    if @pharmacy.save
---
INSERT INTO "pharmacies" ("pharm_name", "address", "phone_number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["pharm_name", "test"], ["address", "test"], ["phone_number", "123-456-789"], ["user_id", 1], ["created_at", "2020-03-09 16:45:37.047252"], ["updated_at", "2020-03-09 16:45:37.047252"]]
INSERT INTO "pharmacies" ("pharm_name", "address", "phone_number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["pharm_name", "duane reade"], ["address", "1234"], ["phone_number", "1234"], ["user_id", 1], ["created_at", "2020-03-09 23:31:22.809274"], ["updated_at", "2020-03-09 23:31:22.809274"]]

  def update
    if @pharmacy.update(pharmacy_params)
---
UPDATE "pharmacies" SET "comment" = $1, "updated_at" = $2 WHERE "pharmacies"."id" = $3  [["comment", "Duane Reade comment section"], ["updated_at", "2020-03-09 14:49:49.963429"], ["id", 2]]

  def destroy
    @pharmacy.destroy
---
DELETE FROM "pharmacies" WHERE "pharmacies"."id" = $1  [["id", 1]]

    def set_pharmacy
      @pharmacy = @user.pharmacies.find_by!(id: params[:id]) if @user
---
SELECT "pharmacies".* FROM "pharmacies" WHERE "pharmacies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]